app/controllers/employees_controller.rb

  def index
    @employees = Employee.where(user_id: session[:user_id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."deleted_at" IS NULL AND "employees"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]

  def create
    # binding.irb
    @employee = Employee.new(employee_params.merge(user_id: @user.id))
    # employee_params_hash = employee_params.to_h
    # @employee = Employee.new(employee_params_hash.merge(user_id: @user.id))
    if @employee.save
---
INSERT INTO "employees" ("employee_first_name", "employee_last_name", "employee_age", "employee_contact", "employee_email", "employee_salary", "employee_joining_date", "created_at", "updated_at", "deleted_at", "employee_image", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def edit
    @employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."deleted_at" IS NULL AND "employees"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def update
    @employee = Employee.find(params[:id])
    if @employee.update(employee_params)
---
SELECT "employees".* FROM "employees" WHERE "employees"."deleted_at" IS NULL AND "employees"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "employees" SET "employee_age" = ?, "employee_salary" = ?, "employee_joining_date" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["employee_age", 22], ["employee_salary", 4525], ["employee_joining_date", "2024-02-14"], ["updated_at", "2024-02-14 07:15:31.306903"], ["id", 21]]

  def destroy
    @employee = Employee.find(params[:id])
    @employee.destroy
---
SELECT "employees".* FROM "employees" WHERE "employees"."deleted_at" IS NULL AND "employees"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 4]]

  def delete_employees
    @employee = Employee.with_deleted.where.not(deleted_at: nil).where(user_id: session[:user_id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."deleted_at" IS NOT NULL AND "employees"."user_id" = ?  [["user_id", 3]]

  def restore_employee
    # binding.ir
    @employee = Employee.with_deleted.find(params[:id])
    @employee.update(deleted_at: nil)
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "employees" SET "updated_at" = ?, "deleted_at" = ? WHERE "employees"."id" = ?  [["updated_at", "2024-02-12 11:49:41.935313"], ["deleted_at", nil], ["id", 8]]

  def current_user
    if session[:user_id]
      @user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]