app/controllers/users_controller.rb

  def sign_up
    # binding.irb
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["username", "ankush"], ["email", "A@GMAIL.COM"], ["password_digest", "[FILTERED]"], ["created_at", "2024-02-09 14:25:24.402211"], ["updated_at", "2024-02-09 14:25:24.402211"]]

  def login
    @user = User.find_by_username(params[:user][:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "param"], ["LIMIT", 1]]